{
  "titulo": "Granja con Spawner"
  ,"sinopsis": "Construye una granja de experiencia y loots con un Spawner de mazmorra evitando morir en el intento"
  ,"tutorial": "Convertir un spawner en una granja de experiencia\n===================\n\n*Realizado por Miki_Lopez  ---  Versión 1.0 [25/07/2013]*\n\nCon este manual aprenderás a fabricar una granja que te permitirá obtener rápidamente experiencia, además de otros materiales y subir en el ranking de muertes del servidor.\n\n# Spawners #\n\nEste manual se centra en el uso y aprovechamiento de un **spawner**, o mejor dicho, **mazmorra** (*dungeon* en inglés). Estas mazmorras aparecen por todo el mapa, bajo tierra, y consisten en una pequeña habitación de dimensiones ligeramente variables, con paredes de roca, suelo de roca musgosa, algún cofre y en el centro, un bloque de spawner.\n\n![Imagen](/content/images/granja_spawner/spawner.png 'Un spawner de arañas')\n\n## Reglas de spawneo ##\n\nEl bloque central hará aparecer algún tipo de mob hostil (araña, zombie o esqueleto), siempre que se cumplan estas condiciones:\n\n* Haya un jugador a una distancia de 16 bloques o menos.\n* El nivel de iluminación permita la aparición de mobs.\n\nLas mazmorras se saltan ciertas normas sobre la aparición de mobs:\n\n* No puede aparecer un mob que no sea el del bloque.\n* Los mobs pueden aparecer sobre losas o agua.\n\n## Frecuencia de spawneo ##\nLa frecuencia de aparición es aleatoria, ajustada dentro de un rango.\n\n* Siempre que sea posible, spawnearán entre 1 y 4 mobs simultáneamente.\n* Una vez spawneen, no volverá a spawnear nada hasta pasados entre 10 y 40 segundos.\n\n## Área de spawneo ##\nEl área en la que se puede spawnear se describe así:\n\n* El centro está en la esquina inferior orientada al noroeste.\n* Desde esa esquina, pueden aparecer en 4 bloques al norte y al sur (si hay espacio).\n* Desde esa esquina, pueden aparecer en 4 bloques al este y al oeste (si hay espacio).\n* Desde esa esquina, pueden aparecer en 1 bloque arriba o abajo (si hay suelo).\n\n# Preparando la trampa #\n\n## Materiales necesarios ##\n\nEsta es una lista de los materiales esenciales para la creación de la trampa:\n\n* Pico\n* Antorchas\n* Dos cubos de agua\n* Bloque de construcción favorito (roca, ladrillo...)\n\n## Acomodando el área ##\n\nUna vez localizado un spawner, lo primero que se ha de hacer es **iluminarlo**, para así evitar la aparición de mobs mientras se está trabajando en él. Se recomienda colocar una antorcha en cada lado de bloque, una encima, y una centrada en cada pared, dos bloques por encima del bloque de spawn.\nAsí mismo, resulta buena idea **sellar** la cámara para evitar la entrada de mobs no deseados.\n\n## Suelo adecuado ##\n\nSe localizará la esquina central del spawner, y a partir de ahí se contarán 4 bloques en cada dirección (norte, sur, este, oeste). En caso de encontrar pared, picar hasta conseguir un suelo de 8x8. Si la pared va más allá de este tamaño, hacer una pared nueva para ajustarlo al tamaño.\n\n## Empuje con agua ##\n\nElegir una pared al azar, y cavar un zanja en el suelo de 2 bloques de profundidad. En la pared opuesta, picar la fila baja de la pared, y llenarla entera de agua. Para ello, colocar un cubo en el lado izquierdo (bloque 1), y el otro cubo en el bloque 3. Automáticamente el bloque 2 se rellenará de agua, por lo que se podrá llenar el cubo y completar el bloque 5, haciendo que el 4 se rellene de agua. Repetir sucesivamente hasta completar los 8 bloques.\n\n**Cuidado**: el agua te empujará hacia la zanja y retirará las antorchas laterales del bloque de spawn. Las antorchas caerán a la zanja.\n\n![Imagen](/content/images/granja_spawner/sala_lista.png 'Habitación lista')\n\n## Salvoconducto ##\n\nPreparar un conducto de salida de la sala, romper todas las antorchas, salir lo antes posible (pues spawnearán monstruos) y volver a sellar la sala.\n\n# Recogida de experiencia #\n\nLa parte principal de la trampa ya está lista. Ahora mientras haya un jugador a menos de 16 bloques de distancia del bloque de spawn, la zanja se irá llenando de mobs. Para matar los mobs y así conseguir experiencia, material y muertes, se puede preparar la zanja de diversas formas.\n\n## Golpear a los pies ##\n\nLa forma más sencilla de matar a los mobs, es picar un pasillo paralelo a la zanja, un bloque más bajo, para así poder golpear a los mobs sin que ellos puedan golpearte a ti. Mientras los golpeas, seguirán apareciendo más debido a la cercanía del bloque de spawn.\n\n![Imagen](/content/images/granja_spawner/tobillos.png 'Golpeando a los pies')\n\nEste método tiene la desventaja de que los mobs tienen la vida al completo, y por tanto tardan en morir y gastan espada. Por eso existen alternativas.\n\n## Caída ##\n\nSimplemente cambiando la altura de la zanja de 2 bloques a 21-22, la caída hace tanto daño a los mobs que con uno o dos golpes con el puño pueden morir. Esto hace más rápido y fácil obtener la experiencia. Por contrapartida el bloque de spawn queda tan lejos que mientras se esté matando mobs no aparecerán nuevos, por lo que hay que permanecer un tiempo arriba y, tras acumular varios mobs, bajar y matarlos.\n\n## Concentración ##\n\nHay quien encuentra que moverse a lo largo de los 8 bloques de la zanja le resulta no del todo óptimo, así que se puede mejorar de la siguiente manera: en la zanja original, se coloca un bloque de agua en un extremo. Al otro extremo, se hace otra zanja de 1 bloque de ancho. Así todos los mobs se acumulan en un solo bloque, lo que facilita su muerte. Además, esta zanja puede ser igualmente de 22 bloques de profundidad, para poder matar los mobs de un solo golpe.\n\n![Imagen](/content/images/granja_spawner/1bloque.png 'Los mobs se acumularán en un solo bloque')\n\n![Imagen](/content/images/granja_spawner/1bloqueb.png 'Docenas de esqueletos en muy poco espacio')\n\n# Recomendaciones #\n\nTener en cuenta las siguientes recomendaciones:\n\n* No intentar granjear experiencia con spawners de arañas, ya que hace falta una zanja el doble de ancha, la cual pueden volver a escalar, y como son menos altas, no funciona lo de darles en los tobillos (se escapan y sálvese quien pueda).\n* Al fondo de la zanja se pueden colocar losas, y bajo estas, tolvas, y así poder recoger automáticamente todo lo que suelten los mobs y llevarlo a un cofre.\n* No dejar aparecer mobs durante más de dos horas, puede ocasionar problemas tanto en el servidor como en el cliente.\n* No se puede encantar nada por encima del nivel 30, ni reparar nada por encima del 40, y cada nivel cuesta más de conseguir, así que no es provechoso almacenar más experiencia que la de conseguir el nivel 40.\n"
  ,"imagesFolder": "granja_spawner"
  ,"author": "Miki_Lopez"
  ,"submissionDate": null
},
{
  "titulo": "Primeros pasos"
  ,"sinopsis": "Guía basica de inicio en el servidor, aprende a configurar tu Minecarft y lo que debes hacer la primera vez que te conectes"
  ,"tutorial": "Cómo jugar en el servidor/n======================/n/n*Realizado por Miki_Lopez  ---  Versin 1.0 [02/09/2013]*/n/nSi eres nueva/o en el servidor, se recomienda leer este tutorial para saber cmo funciona el servidor. Aqu se explica cmo empezar a jugar en l y qu cosas tiene de especial, para que las disfrutes todas./n/n# Primeros pasos #/n/nLa nica forma de entrar en el servidor es mediante invitacin. La forma ms directa es que se te invite y te presentes en el grupo de Facebook./n/n`https://www.facebook.com/groups/539129696145682`/n/nAs se habilitar tu nombre de usuario en el servidor. Es importante leerse las normas, que estn en la pgina web./n/n`http://kajuryto.com/normas`/n/nUna vez hecho todo, ya podrs entrar, tan solo has de aadir la direccin IP del servidor a tu lista de servidores, desde `Multijugador` > `Aadir servidor`/n/n![Imagen](/content/images/primerosPasos/anadir_server.png 'Aadiendo nuevo servidor a la lista')/n/n## Instalando el juego ##/n/nSi por alguna razn no tienes este maravilloso juego todava en tu ordenador, o tienes una versin anterior a la 1.6, instalarlo es muy sencillo, tan solo has de descargarte el Launcher, est disponible en la los archivos del grupo de Facebook/n/n![Imagen](/content/images/primerosPasos/descarga.png 'Archivo a descargar')/n/nEs un archivo de Java vlido para Windows, Linux y Mac. Una vez abierto te sale esta ventana, en la cual en `Username` tendremos que poner nuestro usuario, y darle al botn `Play`/n/n![Imagen](/content/images/primerosPasos/launcher1.png 'Iniciando sesin en el juego')/n/nUna vez hecho, la ventana cambiar ligeramente, y donde estaba el botn `Play` ahora tendremos un `Play offline`. A partir de ahora, cada vez que se abra el juego, nos aparecer ese botn y podremos iniciar el juego. La primera vez tardar un poco porque descarg archivos del juego, como texturas y sonidos./nUna vez iniciado el juego, hay que aadir el servidor a la lista, como se ha indicado ms arriba, y ya se podr jugar./n/n# Registro e inicio de sesin en el servidor #/n/nLa primera vez que te conectes al servidor, te pedir que te registres con una contrasea. Para ello, pulsa la tecla `T` para abrir el chat, y escribe la siguiente lnea y pulsa `Enter`/n/n`/register contrasea`/n/n![Imagen](/content/images/primerosPasos/registro.png 'Registrndose con la contrasea secreto1234')/n/nA partir de ah, cada vez que entremos en el servidor, tendremos que iniciar sesin abriendo el chat y escribiendo/n/n`/login contrasea`/n/n![Imagen](/content/images/primerosPasos/inicio.png 'Iniciando sesin')/n/nEs importante saber que mientras no se inicie sesin es imposible moverse, interactuar con el terreno ni ver nada ms all de unos pocos bloques. Igualmente mientras no se inicie sesin, nada puede afectar al jugador./n/nSi se desea cambiar la contrasea, solo has de utilizar el comando `changepass pass_vieja pass_nueva`/n/n`/changepass secreto1234 nueva1234`/n/n![Imagen](/content/images/primerosPasos/cambio.png 'Cambiando la contrasea')/n/n# Tu zona de residencia en el servidor #/n/nEl servidor est diseado para que inicialmente aparezcas en una zona al azar en el mapa. Si no te gusta te movers hasta encontrar un sitio que te agrade. Es muy importante, una vez encontrada esta zona, asignar tu hogar a ese sitio. De hecho, se recomiendo hacer esto nada ms registrarse en el servidor. Para hacerlo, solo hay que ejecutar este comando./n/n`/sethome`/n/nPor qu es **importante** hacer esto? Porque si mueres, o si te pierdes, puedes volver fcilmente a tu casa. Para volver, slo tienes que usar este otro comando/n/n`/home`/n/nTen en cuenta que este ltimo slo puedes usarlo una vez cada hora (60 minutos), as que lleva cuidado./n/nSiempre que quieras, puedes cambiar tu hogar a donde t quieras. Es decir, si decides construir una segunda casa en otro sitio, puedes hacer `/sethome` en ese nuevo sitio./n/n## La sala del Limbo ##/n/nSi en algn momento murieras, reaparecers en la Sala del Limbo. Es una sala de la cual es imposible salir, excepto teletrasportndose. Por ello es importante haber hecho `/sethome`, para as poder volver a casa con `/home`. En el caso de no haber asignado el hogar previamente, contacta con el adminstrador para que solucione el problema, pero ten en cuenta que si la situacin se repite, podras ser baneado del servidor./n/n![Imagen](/content/images/primerosPasos/limbo.png 'As es el Limbo')/n/n## Otras formas de localizacin ##/nPara saber dnde est tu casa, puedes crear un **mapa en el juego**. Solo has de rodear una brjula con papel en la mesa de trabajo, y para ampliar el mapa, rodearlo de ms papel (hasta 5 veces)./n/nTambin puedes usar el **mapa del servidor**. Se accede a travs de la direccin `http://maps.kajuryto.com` y haciendo clic en tu nombre de usuario (panel de la derecha, se despliega al acercar el ratn), cuadra el mapa en tu posicin. Puedes aadir marcadores para sealizar tus construcciones o cosas interesantes que encuentres, pero sin abusar!/n/nPara aadir un nuevo marcador, sitate en la posicin del mapa donde quieres que aparezca y escribre/n/n`/dmarker add 'Texto del marcador'`/n/nImportante no olvidar las comillas. Para eliminar un marcador es exactamente igual, y puedes hacerlo desde cualquier parte del mapa, solo cambia 'add' por 'delete'/n/n`/dmarker delete 'Texto del marcador'`/n/n![Imagen](/content/images/primerosPasos/mapa.png 'Jugador tutorio cerca de su casa')/n/nPor ltimo, puedes utilizar la **informacin de depuracin** del juego, pulsando la tecla `F3`, ah aparece mucha informacin, entre ella, tus coordenadas espaciales dentro del mapa, que corresponden con el bloque que est bajo tus pies. La coordenada X indica tu posicin este-oeste, mientras que la Z indica tu posicin norte-sur. La Y representa la altura del suelo, lo cual no suele ser til para localizacin. Anota tus coordenadas X,Z y as podrs volver a tu casa de forma fcil. Cuidado, estas coordenadas tienen muchos decimales, no hace falta que los anotes./n/n# El contador de muertes #/n/nEn las ltimas versiones de Minecraft, pulsando la tecla `Tabulacin` es posible ver los dems jugadores conectados as como su velocidad de conexin (con un indicador verde). En el servidor, adems, se puede ver un valor numrico. Este es el **contador de muertes**, e indica a cuntos enemigos, jugadores o animales ha matado el jugador. Este contador no se reinicia si mueres./n/nMs all de un mero ranking, el contador de muertes tiene una utilidad especial. En las coordenadas (0,0), el centro del mapa, se encuentra una torre, la **Torre de la Muerte**, la cual tiene una serie de pedestales en los que un jugador puede colocarse, y puede canjear sus muertes por premios. Hay pedestales para cambiar por 1000, 2000, 5000 y 10000 muertes, haciendo un total de **ocho pedestales**. Los premios son un secreto y un regalo del FSM, as que no se sabe mucho de ellos./n/nPor ejemplo, un jugador con 2026 muertes en su haber, podra cambiarlas por un premio de 2000 muertes, o por dos de 1000 muertes, quedando su contador a 26 tras recibir el premio."
  ,"imagesFolder": "primerosPasos"
  ,"author": "Miki_Lopez"
  ,"submissionDate": null
}